package com.ucap.lawyers.bean;

import java.util.List;

/**
 * Created by wekingwang on 16/8/22.
 * 律所分类查询
 */
public class FirmDate {
    /**
     * groupsize : {"groupsize":630}
     * rows : [{"gyzs":111,"phone":"02887510607","weburl":"http://www.schenggao.com/","lawyerlist":["赵斌","张泽敏","徐江","赵英","金勇","罗俊杰","李俊杰","谢徳毅","戢霞"],"groupname":"金牛区司法局","yearcheck":"合格","gfzs":"无","id":58,"typesettings":"徐江","groupnum":"25101201230363433","address":"金牛区金府路799号金府国际2栋12楼21号","email":"470505596@qq.com","hhrlist":[],"description":"四川恒高律师事务所（简称\u201c恒高律师\u201d）是一家以建设工程与房地产、法律顾问、公司企业、经济（金融）、刑事类法律事务为专业核心的具有广泛社会资源和人脉关系的专业化律师事务所。 事务所坚持\u201c专业、专注、勤业\u201d和\u201c高起点、高效率、高质量\u201d的执业理念面向社会提供全方位专业化法律服务，追求与委托人建立长期互信的合作关系，以谋求委托人不抵触法律的最大权益和实现委托人的根本利益为服务宗旨。 事务所在兼顾传统业务的基础上，努力在专业化道路上进行探索和突破，并取得了较好的成效，基本形成了工程经济类和非诉类业务两大专业核心和特色。 事务所人员执业经验丰富、职业道德良好、专业分工明确，具备承办重大、复杂、疑难、专业法律事务的资质。事务所主任系省优秀律师、拥有10年以上的实际从业经历，并在事务所的专业核心领域内具有丰富的实务处理经验和较高的理论水平。","showname":"个人所","name":"四川恒高律师事务所","ryzs":"无","fmzs":"无"},{"gyzs":21,"phone":"028\u201465176088","weburl":"www.scysls.com","lawyerlist":["郑佐洪","吕莹","肖攀","唐霞","唐修学","曾瑛","梁登俊","阮文莉","李念刚","涂玉萍","曾昭元","吴勇","许文林","张婧","王浩驰","陈勇良","卿山","辜建勇","袁洪春","袁雪","林巧","王洁","欧成瑶","李方园"],"groupname":"武侯区司法局","yearcheck":"合格","gfzs":"无","id":350,"typesettings":"许文林","groupnum":"25101201210026927","address":"四川省成都市武侯区佳灵路5号1栋5楼506室","email":"2248917234@qq.com","hhrlist":["唐霞","张婧"],"description":"四川原石律师事务所是经四川省司法厅于2011年1月31日批准成立的普通合伙制律师事务所，主管行政机关为成都市武侯区司法局，办公地址为成都市武侯区佳灵路5号1栋5楼506室，联系电话：02865176088。本所汇聚了一批法律功底扎实、执业经验丰富的资深律师，也吸收了一批毕业既谙熟法律理论知识又兼具开拓创新精神的中青年律师。全所同仁秉承\u201c厚德明法，诚信维权\u201d的宗旨，坚持为当事人提供优质、高效的法律服务。\r\n本所适宜担任机关、团体、企事业单位的常年法律顾问，代理各类非诉讼业务，专业办理以下各类案件：工伤代理、劳动争议、妇女维权、交通事故、医疗纠纷、刑事辩护、损害赔偿、财产继承、房产纠纷、合同纠纷、知识产权、行政诉讼。\r\n","showname":"合伙人:(2)","name":"四川原石律师事务所","ryzs":4,"fmzs":"无"},{"gyzs":7,"phone":"028-87042853","weburl":"无","lawyerlist":["刘群芳","田玲","赖元超","李德平","李公科","赵永祥","周倩","曾家煜","汪洋","周仁来","冯燕","袁渝寒","姜芳","蒋安兵","郑泰安","马朝兴","罗茜","谭臻","严立","夏良田","韩旭","郑显芳","吴宇宏","高高","杜诗仲","彭育波","马冀","郝勇","周友苏","廖静怡","刘利","龚立燕","齐涛","杨勇","江玲","李莉萍","邵伟","张杰","王胜","刘红霞","孔建会","姜璟俊","熊正","肖菊","郑果","武晓光","黄勇","何健","彭刚","丁菊","黄琼瑶","杨涿","王启毅","刘敏","唐坤","张一杨","李潇潇","刘岑木彦","孙小东","宇龙","高畅","曹婷","周海洋","冯叶"],"groupname":"代管所","yearcheck":"合格","gfzs":"无","id":163,"typesettings":"曾家煜","groupnum":"25101200021464718","address":"四川省成都市高新区府城大道中段88号中航城区广场1栋9楼1号","email":"chengdu@dehenglaw.com","hhrlist":[],"description":"北京德恒（成都）律师事务所（以下简称德恒成都所）于2012年12月13日由四川省司法厅批准设立，办公地址位于成都市高新区府城大道88号中航城市广场901室，拥有成都一流的办公设施及办公环境。\r\n德恒成都所整合了原四川社科律师事务所和成都威尔律师事务所等多家律所的优秀律师，目前执业律师共50人，其中研究员4人、博士5人，硕士12，还有从美国归来的双博士。全所律师的综合素质较高，共有七名律师曾经担任过法官、检察官、公安干警，复合型人才较多。\r\n","showname":"派驻律师:(64)","name":"北京德恒（成都）律师事务所","ryzs":"无","fmzs":"无"},{"gyzs":6,"phone":"02886770180","weburl":"www.junyilawyer.cn","lawyerlist":["刘荣丽","李泝宏","徐凤玲","徐斌","刘欣","李于","雷伟","张妍妍","罗泽锋","屈智硕","代明","孙刚","林幼琴","谢青","杨博","张定","闫林","王沛","童颖","王兵","伍琳","王栋"],"groupname":"青羊区司法局","yearcheck":"合格","gfzs":"无","id":192,"typesettings":"李泝宏","groupnum":"25101200110136060","address":"四川省成都市八宝街1号万和苑B座2401、2402","email":"sichuanjunyi_2401@sina.com","hhrlist":["徐斌","林幼琴"],"description":"四川君益律师事务所是直属成都市司法局的合伙制律师事务所，以先进的合伙体制和民主管理模式聚集了大批高素质法律人才。本所由\u201c四川省优秀律师\u201d李泝宏于2001年5月11日发起成立。经过合伙人及执业律师十多年的工作生涯，积累了丰富的处理大型、疑难、复杂法律事务的经验和能力，并通过自己\u201c勤勉敬业、专业诚信\u201d的服务精神取得了骄人的业绩，赢得了社会各界人士的肯定。\r\n ","showname":"合伙人:(2)","name":"四川君益律师事务所","ryzs":1,"fmzs":"无"},{"gyzs":5,"phone":"028-66500005","weburl":"www.mjlsh.com","lawyerlist":["杨毅","汤昌军","李林虹","刘晓静","伍明辉","谢惠芬","林卓","冯家辉","陈宇","王桂芬","刘崇文","李一冰","彭军","樊婷","张飞","罗巧","黄兴林","殷立勇","赵娟","龚明军","陈科","费云喆","冯正广","廖静","李凌","杨碧宁","郑晓","周帆","颜波","张勇","朱鹏","范自力","卢晓帆","吴中学","付姝","王翔","张艳","曾义","龚勇","陈栋","邓学强","毛政文","李君","黄勇","廖国斌","崔雄","唐勇","杨明勇","周建春","王钧瑶","王莉","唐建华","熊德秋","方箭","邱平","蒋兴伟","李凡涛","唐钰芸","宋建明","陈莅新","彭慧英","刘力","李富强","邓和平","杨勇","陈斌","张浩","王德波","卢子彬","王林","万清华","李华","罗选东","梁开阔","吴青松","唐安民","郭毅","邱万兵","龙天文","刘鑫","叶江雄","刘昌军","胡波","王宗旗","汪毅","白强","高民权","黄章果","杨明勇","袁斌","蔡锁阳","洪浩","林维实","罗芳","沈宥希","赵熙良","杜维","王荣","李力","陈晓冬","安显聪","李婷","沈时","叶佳","徐斌","沈友苓","赵因","张雪梅","代廷模","郭凌","李鹏","吴潇","席日钢","张晓峰","王业礼","祝立","艾鑫颜","罗强","胡汇沅","王波","胡晓静","张轶超","彭传雨","王浩","文戈","李洪斌","黄琼","叶茂","吴纯权","陈瑶","黄琴","张锋","李竹兵","张钰卓","罗婷婷","滑莹","魏杰","郭帅","王星","吴亚玲","张伟华","赵先泉","李明海","邓鹏","姚金容","孙军","杨阳","任小燕","李天洁","明向阳","卓勇","邓海明","余梅箭","张树云","王浩锋","刘书玲","王松","刘清","杨小勇","牟敏","王辉","徐政","高媛媛","肖融","张麟超","徐梅","杨静雯","胡文君","李文玲","高一杨","陈婷","钟鸣晓","郝明俊","姜昱","侯昊旻","林辉轮","邓俊杰","龚照伦","马晓林","秦睿","杜海","何亚林","徐力","薛晓彤","王川","郑绪成","杨杰","罗云路","陈瑞雪","张建平","彭加荣","李俊兰","朱伟","王琴","杨爽","张宇","吴斯","徐小蓉","余鹏涛","王劲涛","罗龙","杨代昌","李洋洋","杨钊","江澎","徐晓冬","王赛男","李秋培","文星","左皓天","张攀","夏畦凇","罗华旻","刘娟","陈丁莎","霍子诗","王录生","张红斌","华小榕","王璐瑶","谢丹","黄菊","柯春莉","杨稔","韦文正","林永","杨成娟","张皓","刘金辉","邱晨","陈云莹","方千枝","赵顺喜","洪运","肖华","邱永兰","胡昊宇","魏伯吹","蒲思恒","舒天翊","刘伟","李良华","温峰燕","李军","陈自强","陈满华","黎婉婧","肖春成","高原羚","高竹君","胡朋","税浴洋","王颖","李凌","王晓敏","兰茜","杨小洁","张子刚","董诗琪","侯坤","裘丰华","马浩心","邹宗方","龚正俊","何东","任艳丽","刘世建","谢非","徐瑾","陈霞","廖乃潼","彭鸿","邓晨曦","张帆","朱明高","王皓光","任怡菲","王洋","江峰","向雪","侯永生","姜小娟","朱洲","白玫","杨天武","罗鋆"],"groupname":"代管所","yearcheck":"合格","gfzs":"无","id":124,"typesettings":"王宗旗","groupnum":"25101199620574774","address":"成都市天府大道北段1700号N1 11楼","email":"mj@mjlsh.com","hhrlist":["伍明辉","谢惠芬","冯家辉","李一冰","罗巧","黄兴林","龚明军","费云喆","颜波","张勇","范自力","龚勇","邓学强","毛政文","李君","黄勇","王莉","方箭","彭慧英","刘力","李富强","王德波","王林","梁开阔","邱万兵","叶江雄","刘昌军","胡波","汪毅","白强","杨明勇","安显聪","张雪梅","张晓峰","李洪斌","张锋","姚金容","明向阳","徐政","霍子诗","李军","陈自强"],"description":"无","showname":"合伙人:(42)","name":"四川明炬律师事务所","ryzs":14,"fmzs":"无"},{"gyzs":4,"phone":"028-88553286","weburl":"无","lawyerlist":["牟勇","吴琼","陈世铭","曹艺华","唐远翔","周海波","梁烨","熊智瑶","蒋利苹","解春蕾","张世文"],"groupname":"蒲江县司法局","yearcheck":"合格","gfzs":"无","id":511,"typesettings":"陈世铭","groupnum":"25101200010301865","address":"四川省蒲江县鹤山镇朝阳大道255号","email":"1025743779@qq.com","hhrlist":["曹艺华","梁烨"],"description":"四川智盛律师事务所自2001年成立以来，秉持\u201c受人之托、忠人之事，诚信为本、精业求实\u201d的服务宗旨，通过科学规范的内部管理，坚持承办律师具体负责与团队协作相结合的工作机制，为当事人提供优质高效的法律服务，受到了社会各界的广泛认同。事务所拥有近300平方米的办公用房和现代化的交通、办公设备，硬件、软件设施完善。事务所现有执业律师8名，实习律师2名，律师助理1名，行政人员1名。执业律师曾分别就学于北京大学、西南政法大学、四川大学、四川农业大学、法国艾克斯-马赛第三大学等高校，既有从业二十多年积累了丰富法律知识、实务经验的资深律师和法学、经管专业双学历背景的复合型律师，也有具备深厚法学理论基础的大学法学教师和中西交融背景的年轻律师，形成了以中青年律师为主的年龄结构科学合理的律师团队。事务所长期担任蒲江县委、县政府、县人大常委会及工业区管委会、财政局、国土局、交通局等政府职能机构、部门，多家国有公司及民营企业法律顾问，成功办理了系列重大行政、经济等非诉讼法律事务。在刑诉、民诉及行政诉讼三大诉讼业务方面，成功办理了系列影响较大的职务犯罪、经济犯罪等刑事案件、大要民商（经）案件和重大行政诉讼案件，业务区域涵盖北京、上海、天津、江苏等地区。近三年我所律师业务总收入为400余万元，其中诉讼类业务占60%，非诉讼类业务占40%。事务所被市司法局、市律师协会评为\u201c成都市优秀律师事务所\u201d，多次被县司法局评为\u201c法律服务工作先进单位\u201d。","showname":"合伙人:(2)","name":"四川智盛律师事务所","ryzs":3,"fmzs":"无"},{"gyzs":4,"phone":"13982115598","weburl":"http://www.pulianlawyer.com","lawyerlist":["吴明","蒲永","张光虎","李志栋","郭建","段军平","林其敏","陈曦","赖泓宇"],"groupname":"新都区司法局","yearcheck":"合格","gfzs":"无","id":295,"typesettings":"蒲永","groupnum":"25101200930351173","address":"成都市新都区大丰街道三元大道北新国际广场3幢8层809号","email":"582669613@qq.com","hhrlist":[],"description":" 四川普联律师事务所经四川省司法厅依法批准设立，是四川大学、西南财经大学、四川师范大学法学人才司法教学实习基地。\r\n 现有执业律师及辅助人员10人，其中法学博士2名，法学硕士4名，2名律师拥有海外留学背景，能以英语、日语作为工作语言；部分律师兼具注册会计师、税务师、经济师、建造师、证劵从业资格等，能为客户提供多层面、跨领域的专业服务。\r\n 普联以房地产、建筑法律服务为专业特色，以公司商事、金融投资、资源能源、保险财税、劳动纠纷、侵权责任及刑事辩护为主要法律服务领域的专业化、规范化、品牌化法律服务机构。\r\n 普联理念--同心合意、庶几有成，重诺守信、超越期望，尊法机变、业精行远，至诚至善、敬天爱人。 \r\n","showname":"个人所","name":"四川普联律师事务所","ryzs":1,"fmzs":"无"},{"gyzs":3,"phone":"88798864","weburl":"无","lawyerlist":["赵敏","刘庆洪","李国明","徐志忠","谭红英","牟锦莉","康平","高杨"],"groupname":"邛崃市司法局","yearcheck":"合格","gfzs":"无","id":483,"typesettings":"牟锦莉","groupnum":"25101200010095044","address":"邛崃市司马大道华夏民园B区17号","email":"754555937@qq.com","hhrlist":["刘庆洪","徐志忠","谭红英"],"description":"四川众旺律师事务所前身为四川省邛崃市（县）司法局法律顾问处、四川省邛崃市（县）律师事务所，成立于1981年。经过数十年的开拓发展，该所已成为本地较大规模的综合性合伙制律师事务所。该所有律师7人，全部具有本科或相等学历。该所律师坚持信念、精通法律、维护正义、恪守诚信，为党委政府、群团组织、企事业单位、广大人民群众提供优质高效的法律服务，办理了大量重大疑难案件，深受当事人和社会各界好评。该所被评为\u201c服务社会稳定先进单位\u201d，部分律师被评为成都市优秀律师、邛崃市优秀律师。该所2004年12月成立\u201c中共四川众旺律师事务所支部委员会\u201d.","showname":"合伙人:(3)","name":"四川众旺律师事务所","ryzs":2,"fmzs":"无"},{"gyzs":3,"phone":"028-87534001","weburl":"http://www.henghexin.com/","lawyerlist":["朱竹梅","徐鑫月","杨斐","刘世丹","郭涛","张雷","张永","何连辉","钟相坤","陶军","赵军","陈爱丽","陈霞","刘晓远","何勇","李晓兰","葛伟","熊刚","杨仕建","黄海坤","田晶冲","罗林","李大福","马泰","罗旭东","肖钰","张德平","高兴佳","达珍","方利","孟兴炜","敬景程","刘晓林","陈兰","张磊","袁宝成","柏艳梅","马力焜","阳跃","鲁旭","王建平","刘麟霄","马志旭","何姝","张佳","李正国","林贞斌","李群河","刘章","李品怀","张榕宗","何妍雨","杨世蓉","李晨","邱文锋","杨茂琼","廖娟","杨芳","刘树政","王建国","柏鹏","钟晓晓","文岚","刘德友","刘蕾","王明中","李云虎","邦樱花","陈伟翔","隋亚娟","张春山","陈薇","易凡","钟沛岑","陈娇","张媛媛","李旻哲","邓浩","田琪","黄江","王晶晶","何永彬","李爱辉","宋波","林玉芳","叶瑞超","宋曦"," 张黎薇","李雪菁","方和雪","刘纭韬","唐茂淋","刘琴","贺飞鹏","毛星棋","甘雨纯","杨旭","刘力源"],"groupname":"代管所","yearcheck":"合格","gfzs":"无","id":95,"typesettings":"李正国","groupnum":"25101200110213135","address":"四川省成都市高新区吉泰五路118号3栋20层3号","email":"584787221@qq.com","hhrlist":["何勇","李晓兰","田晶冲","马泰","孟兴炜","刘晓林","柏艳梅","杨茂琼"],"description":"恒和信概况\r\n四川恒和信律师事务所创立于2001年，系四川省司法厅直属的综合性律师事务所，2010年，恒和信被四川省司法厅、四川省律师协会授予\u201c优秀律师事务所\u201d荣誉称号；2011年被中华全国律师协会授予\u201c全国优秀律师事务所\u201d荣誉称号；2012年被四川省司法厅授予\u201c四川群众喜爱的优秀律师事务所\u201d荣誉称号；2013年，被四川司法厅和省人事厅授予\u201c司法行政系统先进集体\u201d荣誉称号。\r\n","showname":"合伙人:(8)","name":"四川恒和信律师事务所","ryzs":12,"fmzs":"无"},{"gyzs":1,"phone":"028-85109148","weburl":"http://www.yingtexinlawyer.com/","lawyerlist":["郭佳","张涛","陈冰","宋应旭","马桦","赵军","王慧","曹华","王毅","张永华","张朝建","卢文娟","续薇薇","唐章洪","何菁","张鹏","胡玉","罗俊","徐春","孟凯祥","范其安","蒋雪萍","苏德平","蒋雪华","任正辉","王中元","龚义蓉","张永兴","张勇","白重庆","蒲英","赵绍波","巫江","韩鲲","陈攀科","谢洪萍","毛艳","青桂平","李拴明","贺勇","杨安国","鲍玉刚","金培城","肖延高","钟伟","彭继友","李盼","李善荣","侯铭轩","张长云","韦俊虹","王威","邓伟鹏","刘民蔚","罗勇","孙靖康","唐娣","马卿瀚","蒋雪","李作勇","朱思汉","范超","黄小洵","谢正阳","黄欣","卢克莲","李书策","胡良刚","饶情","杨超","杨力","袁婷婷","邱蜀建","刘伟","姚瑞强"],"groupname":"武侯区司法局","yearcheck":"合格","gfzs":"无","id":87,"typesettings":"李拴明","groupnum":"25101199010483616","address":"成都高升桥东路6号A4E七楼","email":"210534816","hhrlist":["张涛","王慧","王毅","张鹏","张永兴","杨安国"],"description":" 我所成立于1990年5月，由两家\u201c省级文明律师事务所\u201d重组，现有执业律师及助理110人，拥有千余平方米现代办公场所，设有刑事、民商、企业风险管理等十个专业法律事务部。荣获\u201c全国优秀律师事务所\u201d称号，所党支部被中共四川省委授予\u201c先进基层党组织\u201d称号。\r\n 服务范围涵盖民商法律服务和刑事诉讼业务。担任了政府机关、企事业等三百余家单位的常年法律顾问。入选四川省国有资产管理委员会等十余家单位律师库。先后完成数十家国有大中型企业破产及资产重组案，承办了唐某投毒杀人案（死刑改判无罪释放）、马某1300余万元合同诈骗案（无罪释放）等百余件典型案件。\r\n 我所奉行\u201c以德为本，法律至上，敬业尽责，高效卓越\u201d的服务理念。\r\n","showname":"合伙人:(6)","name":"四川英特信律师事务所","ryzs":23,"fmzs":"无"},{"gyzs":1,"phone":"13880598087","weburl":"http://www.84444666.com","lawyerlist":["陈伟","王玉有","廖述龙","向敬","刘志宏","蒋全明","殷航","谢步强","高扬","任峻锋","唐雪梅","史栋梁","宋旭东","蒲东","吴余茹","张鹏","向俊蓉","唐丽君","邓鑫","覃礼顺 ","黄鹏","钟华","罗水仙 ","康健忠","刘革川","孟洁","张超成","穆战春","李可","易昕","彭刚红","何荣","陈惠敏","徐晶","张明军","文俊","张李军","宋波"],"groupname":"成华区司法局","yearcheck":"合格","gfzs":"无","id":229,"typesettings":"康健忠","groupnum":"25101199310240815","address":"四川省成都市府青路二段2号凯龙财富大厦20楼整层","email":"kangjianzhong@zhongpeilawfirm.com","hhrlist":["向敬","钟华","刘革川"],"description":"四川中沛律师事务所（原成都经贸律师事务所、四川协众律师事务所）系1993年1月经四川省司法厅批准设立的综合型合伙制律师事务所，是成都市最早成立的律师事务所之一。\r\n中沛律师事务所办公地址位于成都市中心区域一环路府青路二段2号高端写字楼凯龙财富大厦20楼整层，拥有1016平方米的现代化办公区域和优良的办公环境。\r\n中沛律师事务所由具有丰富工作经验的资深律师组成，所有律师均具有大学本科以上学历，主要业务领域是企事业单位法律顾问，民事、经济诉讼与仲裁，刑事案件辩护等，尤其在公司、证券、金融、投资、税务、保险、合同、房地产、工程承包、知识产权等诉讼和仲裁领域有着长期丰富的律师办案经验，并能提供各种类型、各种层次的综合性法律服务。","showname":"合伙人:(3)","name":"四川中沛律师事务所","ryzs":"无","fmzs":"无"}]
     */

    private GroupsizeBean groupsize;
    private List<RowsBean> rows;

    public GroupsizeBean getGroupsize() {
        return groupsize;
    }

    public void setGroupsize(GroupsizeBean groupsize) {
        this.groupsize = groupsize;
    }

    public List<RowsBean> getRows() {
        return rows;
    }

    public void setRows(List<RowsBean> rows) {
        this.rows = rows;
    }

    public static class GroupsizeBean {
        /**
         * groupsize : 630
         */

        private String groupsize;

        public String getGroupsize() {
            return groupsize;
        }

        public void setGroupsize(String groupsize) {
            this.groupsize = groupsize;
        }
    }

    public static class RowsBean {
        /**
         * gyzs : 111
         * phone : 02887510607
         * weburl : http://www.schenggao.com/
         * lawyerlist : ["赵斌","张泽敏","徐江","赵英","金勇","罗俊杰","李俊杰","谢徳毅","戢霞"]
         * groupname : 金牛区司法局
         * yearcheck : 合格
         * gfzs : 无
         * id : 58
         * typesettings : 徐江
         * groupnum : 25101201230363433
         * address : 金牛区金府路799号金府国际2栋12楼21号
         * email : 470505596@qq.com
         * hhrlist : []
         * description : 四川恒高律师事务所（简称“恒高律师”）是一家以建设工程与房地产、法律顾问、公司企业、经济（金融）、刑事类法律事务为专业核心的具有广泛社会资源和人脉关系的专业化律师事务所。 事务所坚持“专业、专注、勤业”和“高起点、高效率、高质量”的执业理念面向社会提供全方位专业化法律服务，追求与委托人建立长期互信的合作关系，以谋求委托人不抵触法律的最大权益和实现委托人的根本利益为服务宗旨。 事务所在兼顾传统业务的基础上，努力在专业化道路上进行探索和突破，并取得了较好的成效，基本形成了工程经济类和非诉类业务两大专业核心和特色。 事务所人员执业经验丰富、职业道德良好、专业分工明确，具备承办重大、复杂、疑难、专业法律事务的资质。事务所主任系省优秀律师、拥有10年以上的实际从业经历，并在事务所的专业核心领域内具有丰富的实务处理经验和较高的理论水平。
         * showname : 个人所
         * name : 四川恒高律师事务所
         * ryzs : 无
         * fmzs : 无
         */

        private String gyzs;
        private String phone;
        private String weburl;
        private String groupname;
        private String yearcheck;
        private String gfzs;
        private String id;
        private String typesettings;
        private String groupnum;
        private String address;
        private String email;
        private String description;
        private String showname;
        private String name;
        private String ryzs;
        private String fmzs;
        private List<String> lawyerlist;
        private List<String> hhrlist;

        public String getGyzs() {
            return gyzs;
        }

        public void setGyzs(String gyzs) {
            this.gyzs = gyzs;
        }

        public String getPhone() {
            return phone;
        }

        public void setPhone(String phone) {
            this.phone = phone;
        }

        public String getWeburl() {
            return weburl;
        }

        public void setWeburl(String weburl) {
            this.weburl = weburl;
        }

        public String getGroupname() {
            return groupname;
        }

        public void setGroupname(String groupname) {
            this.groupname = groupname;
        }

        public String getYearcheck() {
            return yearcheck;
        }

        public void setYearcheck(String yearcheck) {
            this.yearcheck = yearcheck;
        }

        public String getGfzs() {
            return gfzs;
        }

        public void setGfzs(String gfzs) {
            this.gfzs = gfzs;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getTypesettings() {
            return typesettings;
        }

        public void setTypesettings(String typesettings) {
            this.typesettings = typesettings;
        }

        public String getGroupnum() {
            return groupnum;
        }

        public void setGroupnum(String groupnum) {
            this.groupnum = groupnum;
        }

        public String getAddress() {
            return address;
        }

        public void setAddress(String address) {
            this.address = address;
        }

        public String getEmail() {
            return email;
        }

        public void setEmail(String email) {
            this.email = email;
        }

        public String getDescription() {
            return description;
        }

        public void setDescription(String description) {
            this.description = description;
        }

        public String getShowname() {
            return showname;
        }

        public void setShowname(String showname) {
            this.showname = showname;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getRyzs() {
            return ryzs;
        }

        public void setRyzs(String ryzs) {
            this.ryzs = ryzs;
        }

        public String getFmzs() {
            return fmzs;
        }

        public void setFmzs(String fmzs) {
            this.fmzs = fmzs;
        }

        public List<String> getLawyerlist() {
            return lawyerlist;
        }

        public void setLawyerlist(List<String> lawyerlist) {
            this.lawyerlist = lawyerlist;
        }

        public List<String> getHhrlist() {
            return hhrlist;
        }

        public void setHhrlist(List<String> hhrlist) {
            this.hhrlist = hhrlist;
        }
    }
}
