package com.ucap.lawyers.bean;


public class PublicData {
    /**
     * 普通用户注册协议
     */
    public static String agreementContent = "尊敬的用户：\n" +
            "您好！ 欢迎使用成都市律师综合信息系统平台（以下简称“平台”）。以下所述条款和条件即构成您就平台使用许可所达成的协议（以下简称“本协议”）。一旦您点击“同意”按钮后，即表示您已接受并知悉了以下所述的条款和条件，自愿认可和信守本协议。包括但不限于本协议和隐私权法律、政策等。\n" +
            "\n" +
            "第一条 使用条款和条件\n" +
            "\n" +
            "1、本客户端的各项电子服务的所有权和运作权归平台所有。用户同意所有注册协议条款并完成注册程序，才能成为本客户端的正式用户。正式用户注册的账号所有权归平台所有，用户只有使用权。所有用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。\n" +
            "2、用户点击同意本协议的，即视为用户确认自己具有享受本客户端服务、下单购买等相应的权利能力和行为能力，能够独立承担法律责任。\n" +
            "3、如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本客户端。\n" +
            "4、平台保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭注销用户账户、清除或编辑内容或取消订单的权利。\n" +
            "第二条 条款和条件修订\n" +
            "根据国家法律法规变化及网络运营需要，平台可在不事先通知用户的情况下，修改本协议下的条款和条件或单独条款和条件。一旦平台将这些修改后的条款和条件或单独条款和条件登载本客户端上即生效，并代替原来的协议。用户如继续使用本服务，则应被视为对修改后的条款和条件或单独条款和条件给予有效而不可撤消的同意。用户在使用本服务时，应定期查阅这些条款和条件，因为平台不会就条款和条件的修改单独发送通知。\n" +
            "第三条 客户端服务\n" +
            "\n" +
            "1、平台通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本客户端规定的情况下，方有权使用本客户端的相关服务。\n" +
            "2、用户必须自行准备如下设备和承担如下开支：\n" +
            "（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；\n" +
            "（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。\n" +
            "第四条 用户信息\n" +
            "\n" +
            "1、用户应自行诚信向本客户端提供注册资料，用户同意其提供的注册资料提交的注册信息均真实、准确、及时、详尽和完整，并不断更新注册资料，以符合及时、详尽和准确的要求；不含有任何违反国家法律、法规及中华人民共和国承认或加入的国际条约的内容，且您通过平台所从事的一切活动都是合法、真实的，不侵害任何第三方的合法权益。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且平台保留终止用户使用平台服务端的各项服务的权利。\n" +
            "2、用户在本客户端进行使用时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，平台不会向外界披露用户隐私信息。\n" +
            "3、用户注册成功后，将产生用户名和密码等账户信息，您可以根据本客户端规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。平台将凭密码进行的所有活动视为用户直接的行为。\n" +
            "4、用户同意，平台拥有通过邮件、短信电话等形式等告知信息的权利。\n" +
            "5、用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。\n" +
            "6、用户使用平台为任何第三方提供服务的，对于用户和第三方之间的纠纷，平台将不承担任何责任。\n" +
            "7、用户同意，平台有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。\n" +
            "第五条 用户依法言行义务\n" +
            "1、不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；\n" +
            "2、从中国大陆向境外传输资料信息时必须符合中国有关法规；\n" +
            "3、不得利用本客户端从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动； \n" +
            "4、不得干扰本客户端的正常运转，不得侵入本客户端及国家计算机信息系统；\n" +
            "5、不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；\n" +
            "6、不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；\n" +
            "7、不得教唆他人从事本条所禁止的行为；\n" +
            "8、不得利用在本客户端注册的账户进行牟利性经营活动；\n" +
            "9、不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应关注并遵守本客户端不时公布或修改的各类合法规则规定。本客户端保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本客户端有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。\n" +
            "第六条 隐私条款\n" +
            "1、平台将认真对待用户的隐私保护。\n" +
            "2、平台将按照隐私保护政策保护用户的隐私和个人信息。\n" +
            "3、平台将采取安全措施合理限度地保护所有用户信息。\n" +
            "4、一些用户选项（例如您的隐私设置）会被存储，以便于您从不同设备上登录时可使用这些选项。 \n" +
            "5、平台将不会在不通知的情况下透露您的个人信息，除非法律要求必须如此或者出于善意相信这样做的目的是为了：\n" +
            "（1）遵守法律法规或遵照司法部门对平台所要求的法律程序；\n" +
            "（2）保护和维护平台的合法权益；\n" +
            "（3）在紧急情况下保护平台的用户或社会大众的个人安全。\n" +
            "第七条 知识产权\n" +
            "1、平台拥有本协议所规定的著作权、商业秘密以及其他相关的知识产权，包括与平台有关的各种文档资料。\n" +
            "2、平台相关标识均属于平台的知识产权，并受到著作权法，商标法和其它知识产权法律的保护，未经授权地复制、模仿、使用或发布上述标识，均被禁止。\n" +
            "3、用户一旦接受本协议，即表明该用户主动将其在任何时间段在本客户端发表的任何形式的信息内容（包括但不限于评价、咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给平台所有，用户同意平台有权就任何主体侵权而单独提起诉讼。\n" +
            "4、本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在平台上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。用户同意并已充分了解本协议的条款，承诺不将已发表于本客户端的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。\n" +
            "5、本客户端所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是平台或其内容提供者的财产，受中国和国际版权法的保护。本客户端上所有内容的汇编是平台的排他财产，受中国和国际版权法的保护。本客户端上所有软件都是平台或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。\n" +
            "6、未经平台事先书面同意，您不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权。\n" +
            "\n" +
            "第八条 免责及责任的限制与排除\n" +
            "\n" +
            "1、平台不就电讯系统或互联网的中断或无法运作、技术故障、计算机错误或病毒、信息损坏或丢失或其它在平台合理控制范围之外的原因而产生的其他任何性质的破坏而向用户或任何第三方承担赔偿责任。\n" +
            "2、平台不保证客户端在操作上不会中断或没有错误，不保证平台会纠正客户端的所有缺陷，亦不保证平台能满足您的所有要求。\n" +
            "3、在所适用的法律允许的范围内，任何一方均无须就数据的丢失和/或损坏及任何间接的、附带的、特殊的、后果性的损失向另一方负责赔偿（包括但不限于损失的利润、业务的中断、商业信息的丢失、商誉损失或其它经济损失）。\n" +
            "4、如果您对平台的任何部分或本协议条款的任何部分不满意，您唯一的和全部的解决方案就是停止继续使用平台。\n" +
            "5、平台不对所承载的内容（文、图、视频、音频）的真实性、科学性、严肃性做任何形式保证。\n" +
            "6、平台致力于提供正确、完整的法律咨询、法律观点，但不保证信息的正确性和完整性，且不对因信息的不正确或遗漏导致的任何损失或损害承担责任。\n" +
            "7、平台承诺律师端模块中的服务提供者均为拥有中华人民共和国律师执业证的专业律师。但咨询建议仅为依据提问者描述而提供建议性内容。是否采用律师的建议是个人行为，平台不承担任何可能产生的责任。\n" +
            "8、特别提示的是，平台上，律师所说的所有内容，均是其个人建议，由于不能当面沟通，条件所限，再加上各地司法情况并不完全一致，律师的建议，仅供参考，并不能当然做为纠纷的立案、审判直接依据。\n" +
            "\n" +
            "第九条 服务内容\n" +
            "本条款所称“咨询”特指用户通过本客户端提交的咨询信息和通过预约特定律师的电话咨询，预约咨询、免费咨询等咨询方式，咨询的交互主体为本客户端的用户和平台合法的律师。\n" +
            "\n" +
            "第十条 不可抗力\n" +
            "如果由于黑客攻击或政府管制或网络通讯瘫痪等对其发生和后果不能预见的事件，双方均确认此属不可抗力；双方应按照不可抗力对影响履行本协议的程度，协商决定是否解除本协议、免除履行本协议的部分义务，或者延期履行本协议。\n" +
            "第十一条 法律及争议解决\n" +
            "1、本协议适用中华人民共和国法律。如遇本协议有关的某一特定事项缺乏明确法律规定，则应参照通用国际商业惯例和（或）行业惯例。\n" +
            "2、因双方就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，任何一方均有权向平台服务器托管地有管辖权的人民法院起诉。\n" +
            "\n" +
            "第十二条 其他\n" +
            "1、本协议构成用户和平台就使用客户端的完整的协议，并取代双方就有关本协议所载任何事项于先前以口头及书面达成的共识。\n" +
            "2、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部分则仍具有法律效力。\n" +
            "3、本协议的标题仅为方便阅读所设，非对条款的定义、限制、解释或描述其范围或界限。\n" +
            "4、平台有权随时根据中华人民共和国有关法律、法规的变化、互联网的发展以及公司经营状况和经营策略的调整等修改本协议。您要继续使用平台就有必要对最新的协议进行仔细阅读和确认。当发生有关争议时，以最新的协议为准。如果不同意所改动的内容，您可以自行删除平台。如果您继续使用平台，则视为您接受本协议的变动。\n" +
            "5、您点击本协议上方的“注册”按钮后，即表示您已接受并知悉了以下所述的条款和条件，并完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。\n" +
            "6、本协议的最终解释权归平台律师所有。\n";
    /**
     * 帮助关于
     */
    public static String helpContent = "一、普通用户账号\n" +
            "普通用户注册成功后，便成为成都市律师综合信息系统平台的合法用户，会得到一个密码和帐号。用户需采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该等活动所导致的任何损失或损害由用户承担，成都市律师综合信息系统平台不承担任何责任。\n" +
            "二、用户承诺\n" +
            "用户同意遵守《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、 《互联网电子公告服务管理规定》、《信息网络传播权保护条例》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》等有关的法律、法规以及政府部门的规定。在任何情况下，如有他人投诉用户违反上述规定的，成都市律师综合信息系统平台如果认为用户的行为可能违反上述法律、法规，成都市律师综合信息系统可以在任何时候，有权不经事先通知终止向该用户提供服务。 成都市律师综合信息系统欢迎用户举报任何违反上述法律或侵犯他人权利的上传内容，一经发现违法或侵权的上传内容，成都市律师综合信息系统将根据相关的法律规定进行删除。\n" +
            "三、禁止行为\n" +
            "除注册协议所规定的禁止性规定外，用户承诺使用成都市律师综合信息系统的过程中，尊重原创作者知识产权等合法权益，不得采取下列行为： 1、未经权利人许可，将不具有著作权的作品上传致成都市律师综合信息系统平台； 2、未经成都市律师综合信息系统平台书面许可，将使用成都市律师综合信息系统平台所载作品进行复制及进行信息网络传播； 3、对他人作品进行评价过程中不得作出倾向性的恶意评价以及人身攻击； 4、上传侵犯他人人身权的作品； 5、上传泄漏他人商业机密、个人隐私、国家机密作品或者言论的。\n" +
            "四、处罚措施\n" +
            "1、如果成都市律师综合信息系统平台发现用户违背本协议禁止性规定，有权利注销用户账户。用户依据《注册协议》发布或传送之任何信息、通讯资料和其它内容，如被删除或未予储存，平台毋须承担任何责任。 2、如果用户的违规行为侵犯他人权益或者违反国家法律禁止性规定，成都市律师综合信息系统平台有权利向权利人以及国家主管机关公开用户注册信息，该行为不视为侵犯用户隐私权。 3、用户在注册账户时填写的电子邮件地址视为用户联系地址，就客户端使用过程中出现的事宜，成都市律师综合信息系统平台将通过该邮箱地址与用户进行联系。\n" +
            "五、免责声明\n" +
            "成都市律师综合信息系统平台客户端为互联网服务提供商，为网络用户提供在线查询相关服务以及在线咨询平台，成都市律师综合信息系统平台并不针对用户提供试题内容或者资料下载等实质性内容服务。根据《侵权责任法》以及《信息网络传播权保护条例》规定，对于用户个人侵权行为，成都市律师综合信息系统平台不承担民事责任。";
}
